# Taps
tap "koekeishiya/formulae"
tap "acsandmann/tap"

# Основные системные пакеты
brew "coreutils"
brew "neovim"
brew "bat"
brew "python"

# CLI утилиты
brew "htop"
brew "tree"
brew "rsync"
brew "p7zip"
brew "gping"
brew "lrzip"
brew "unar"
brew "unzip"
brew "gnu-tar"
brew "jq"
brew "fd"
brew "ripgrep"
brew "lua"
brew "luajit"
brew "luarocks"
brew "uv"
brew "poetry"
brew "node"

# Инструменты для шелла и терминала
brew "fzf"      
brew "zoxide"    
brew "tmux"       
brew "zsh"         
brew "nushell"      
brew "starship"      
brew "media-control" 

# Git и инструменты разработки
brew "git"
brew "lazygit"
brew "git-delta"

# Разработка - языковые серверы и форматтеры

# JavaScript/TypeScript
brew "typescript"
brew "typescript-language-server"
brew "vscode-langservers-extracted"  # html/css/json/eslint
brew "yaml-language-server"
brew "dockerfile-language-server"
brew "prettier"
brew "prettierd"

# Python
brew "pyright"
brew "ruff"

# Rust
brew "rust-analyzer"
brew "rustfmt"
brew "rustup-init"

# Go
brew "go"
brew "gopls"
brew "gofumpt"
brew "golangci-lint"
brew "golines"

# Lua
brew "lua-language-server"
brew "stylua"

# Shell
brew "bash-language-server"
brew "shfmt"
brew "shellcheck"

# Markdown
brew "marksman"

# База данных
brew "pgformatter"

# Другие форматтеры/линтеры
brew "cbfmt"
brew "yq"
brew "yamlfmt"
brew "yamllint"
brew "hadolint"
brew "typstyle"
brew "taplo"
brew "biome"
brew "jq-lsp"

# Другие инструменты разработки
brew "sesh"    
brew "gum"    
brew "codex" 
brew "rift", args: ["tap", "acsandmann/tap"]
brew "fastfetch"    

# Дополнения для bat
brew "bat-extras" 

# Приложения
cask "ayugram"
cask "spotify"
brew "spicetify-cli"
brew "kcat"
cask "psst"
cask "waterfox"
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "raycast"
cask "mos"       
cask "karabiner-elements"
cask "aldente"
cask "typora"
cask "lens"
cask "excalidrawz"
cask "claude-code"
cask "yaak"
cask "beekeeper-studio"
cask "affine"
cask "upscayl"
cask "topnotch"
cask "hazeover"

# Шрифты
cask "font-symbols-only-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "sf-symbols"
cask "font-martian-mono"
cask "font-sketchybar-app-font"
